public class Dictionary {


public static final String[][] DATA_FOR_FORM = {   
      { "рубль", "рубля", "рублей", "0" },
      { "тысяча", "тысячи", "тысяч", "1" },
      { "миллион", "миллиона", "миллионов", "0" },
      { "миллиард", "миллиарда", "миллиардов", "0" },
      { "триллион", "триллиона", "триллионов", "0" },
    };

    public static final String[][] TXT_ONE = 
        {{"","один","два","три","четыре","пять","шесть","семь","восемь","девять"},
        {"","одна","две","три","четыре","пять","шесть","семь","восемь","девять"}};

   public static final String[] TXT_TEN = {"","десять","двадцать","тридцать","сорок","пятьдесят","шестьдесят", "семьдесят","восемьдесят","девяносто"};
   public static final String[] TXT_TEN_1 = {"","десять","одиннадцать","двенадцать","тринадцать","четырнадцать", "пятнадцать","шестнадцать","семнадцать","восемнадцать","девятнадцать","двадцать"};
   public static final String[] TXT_HUNDRED= {"","сто","двести","триста","четыреста","пятьсот","шестьсот","семьсот", "восемьсот","девятьсот"};
 
  }        
